master/cases/halle/2D/simpleFoam.coarseMesh/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cmix                Cmix [ 0 0 0 0 0 0 0 ] 1.0 ;

kappaModel          noDeltaT;

ignitionProperties1
{
    ignite              off;
    ignitionPoint       ignitionPoint   [ 0 1 0 0 0 0 0 ] ( 0.2 0 0.02 ) ;
    timing              timing          [ 0 0 1 0 0 0 0 ] 0.0e-1 ;
    duration            duration        [ 0 0 1 0 0 0 0 ] 1.0e-0 ;
}

// ************************************************************************* //
