master/cases/halle/2D/simpleFoam.coarseMesh/constant/injectorProperties
/*---------------------------------------------------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  1.6                                   | 
|   \  /    A nd           | Web:      http://www.openfoam.org               | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 

FoamFile 
{    version         2.0; 
    format          ascii; 

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary; 
    object          injectorProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
(

// z = 0.0 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.0 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.001 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.001 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.002 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.002 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.003 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.003 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.004 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.004 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.005 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.005 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.006 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.006 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.007 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.007 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.008 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.008 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }

// z = 0.009 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.009 0 0.001);
            direction       (0 0 1);
            diameter        0.0001;
            Cd              1.0;
            mass            4.389e-05;
            nParcels        10;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (0.0     0)
                (0.005     4.4e-05)
                (1.0     4.4e-05)
           );
            temperatureProfile 
            (
                (0.0     305.0)
                (1.0     305.0)
           );
            velocityProfile 
            (
                (0.0     15.0)
                (1.0     15.0)
           );
        }
    }
// ------------------------------------------------------------------------- 
)
