master/cases/halle/2D/simpleFoam.coarseMesh/constant/sprayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sprayProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationSchemes
{
    U               cellPointFace;
    rho             cell;
    p               cell;
    T               cell;
}

subCycles       2;
dtInjection		0.0001;

atomizationModel        off;
//atomizationModel      LISA;

includeOscillation      off;
//breakupModel    TAB;
//breakupModel    ETAB;
//breakupModel    ReitzDiwakar;
breakupModel    off;

//injectorModel         constInjector;
//injectorModel         ChomiakInjector;
//injectorModel         definedInjector;
//injectorModel         pressureSwirlInjector;
injectorModel           hollowConeInjector;

collisionModel  off;

evaporationModel standardEvaporationModel;
//evaporationModel off;

heatTransferModel RanzMarshall;
//heatTransferModel off;

dispersionModel off;

dragModel       standardDragModel;

wallModel       reflect;

specConstAtomizationCoeffs
{
    dropletNozzleDiameterRatio
    (
        0.4
    );
    sprayAngle
    (
        10
    );
}

TABCoeffs
{
    y0              0.0;
    yDot0           0.0;
    Cmu             10.0;
    Comega          8.0;
    WeCrit          12;
}

ETABCoeffs
{
    Cmu         10.0;
    Comega      8.0;
    WeCrit      12;
    k1          0.2;
    k2          0.2;
    WeTransition    100.0;
}

ReitzDiwakarCoeffs
{
    Cbag            6;
    Cb              0.785;
    Cstrip          0.5;
    Cs              10;
}

ReitzKHRTCoeffs
{
    B0              0.61;
    B1              40;
    Ctau            1;
    CRT             0.1;
    msLimit         0.2;
    WeberLimit      6;
}

trajectoryCoeffs
{
    cSpace          1;
    cTime           0.3;
}

standardDragModelCoeffs
{
    preReFactor     0.166667;
    ReExponent      0.666667;
    ReLimiter       1000;
    CdLimiter       0.44;
    Cdistort        2.632;
}

standardEvaporationModelCoeffs
{
    evaporationScheme explicit;
    preReScFactor   0.6;
    ReExponent      0.5;
    ScExponent      0.333333;
}

RanzMarshallCoeffs
{
    preRePrFactor   0.6;
    ReExponent      0.5;
    PrExponent      0.333333;
}

hollowConeInjectorCoeffs
{
    dropletPDF
    {
        //pdfType           exponential;
        pdfType         lognormal;

        lognormalPDF
        {
            minValue          2.50e-6;
            maxValue        112.50e-6;
			mu
			(
			2.96871123133
			3.04210586396
			3.13812641474
			3.27438050265
			3.42976315978
			3.54808317799
			3.60341822324
			3.50286648941
			3.34301541549
			3.1354430143
			);

			sd
			(
			0.330066050524
			0.330003763827
			0.344811918759
			0.3749447015
			0.374522162708
			0.371899414133
			0.354288189496
			0.386501934869
			0.395756652905
			0.395745365168
			);
        }
		
	
	RosinRammlerPDF
        {
            minValue        1e-06;
            maxValue        0.00015;
            d               ( 0.00015 );
            n               ( 3 );
        }
    }

    innerConeAngle
    (
        0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
    );

    outerConeAngle
    (
        5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
    );
}

reflectCoeffs
{
    elasticity      0.9;
}

// ************************************************************************* //
