master/cases/halle/2D/simpleFoam.coarseMesh/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermodynamicProperties;
}
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

//thermoType hMixtureThermo<reactingMixture>;

thermoType      hsPsiMixtureThermo<reactingMixture<gasThermoPhysics>>;

CHEMKINFile         "$FOAM_CASE/chemkin/chem.inp";
CHEMKINThermoFile   "$FOAM_CASE/chemkin/therm.dat";

inertSpecie     N2;

liquidComponents
(
   H2O 
);

liquidProperties
{
    H2O H2O defaultCoeffs;
}

/*********************************************************************/
