master/cases/halle/2D/simpleFoam.coarseMesh/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat     raw;

sets
(
    inlet 
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.001 );
        end     ( 0.100 0 0.001 );
        nPoints 500;
    }
);

surfaces ();

fields          ( U );


// ************************************************************************* //
